Revit 2026 API

# MassSurfaceDataMaterialId Property

---

The visualization material used for the surface for displaying the energy analytical model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MaterialId { get; set; }
```
```vb
Public Property MaterialId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member MaterialId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The input element materialId is not a material element. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace